Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The Tile View is built from a :ref:`base_widget` container and :ref:`base_widget` tiles.
it_it: La Tile View è composta da un contenitore :ref:`base_widget` e da tile :ref:`base_widget`.

source: The Timers are handled and called in :cpp:func:`lv_timer_handler`, which needs to be called every few milliseconds.
it_it: I Timer vengono gestiti e chiamati in :cpp:func:`lv_timer_handler`, che deve essere chiamato ogni pochi millisecondi.

source: The Tiny TTF font engine supports GPOS (Glyph Positioning) and Kern tables.
it_it: Il motore di font Tiny TTF supporta le tabelle GPOS (Glyph Positioning) e Kern.

source: The Top Layer was meant to be used to create Widgets that are visible on all Screens shown on a Display.
it_it: Il Layer Superiore è stato concepito per creare Widget visibili su tutti gli Screen visualizzati su un Display.

source: The Toradex board being on the same network will be able to pull the image from the registry.
it_it: La scheda Toradex, essendo sulla stessa rete, sarà in grado di estrarre l'immagine dal registry.

source: The VS Code Renesas integration behaves very similarly to the e2 Studio plugin described above.
it_it: L'integrazione di VS Code con Renesas si comporta in modo molto simile al plugin e2 Studio descritto sopra.

source: The VS Code extensions rely on these being present.
it_it: Le estensioni VS Code si basano sulla loro presenza.

source: The Viewe IOT AIOT Smart Displays are a series of displays that use ESP32 microcontrollers with integrated multi-modal interactions of GUI/voice/camera, ML/AI edge computing, and seamless connectivity.
it_it: Gli Smart Display Viewe IOT AIOT sono una serie di display che utilizzano microcontrollori ESP32 con interazioni multimodali integrate di GUI/voce/telecamera, edge computing ML/AI e connettività fluida.

source: The Viewe UART Smart Displays are a series of displays that use ESP32 and STM32 microcontrollers with UART/RS232/RS485/CAN Interface and have IO interface for connecting to peripherals.
it_it: I display intelligenti UART Viewe sono una serie di display che utilizzano microcontrollori ESP32 e STM32 con interfaccia UART/RS232/RS485/CAN e dispongono di interfaccia IO per la connessione alle periferiche.

source: The WORKDIR directory is defined as follows:
it_it: La directory WORKDIR è definita come segue:

source: The Wayland `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/wayland>`__ provides integration between LVGL and Wayland-based systems, allowing LVGL applications to render directly into a Wayland surface and handle keyboard, mouse and touch input.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/wayland>`__ Wayland fornisce l'integrazione tra LVGL e sistemi basati su Wayland, consentendo alle applicazioni LVGL di essere renderizzate direttamente su una superficie Wayland e di gestire input da tastiera, mouse e touch.

source: The Wayland driver supports multiple rendering backends, allowing you to choose the most appropriate rendering method for your hardware and use case.
it_it: Il driver Wayland supporta più backend di rendering, consentendo di scegliere quello più appropriato per l'hardware e il caso d'uso.

source: The Whole Flow
it_it: L'Intero flusso

source: The Widget can either be scrolled horizontally or vertically in one stroke; diagonal scrolling is not possible.
it_it: Il Widget può essere scorrevole orizzontalmente o verticalmente con un solo movimento; lo scorrimento diagonale non è possibile.

source: The Widget that triggered the event can be retrieved with:
it_it: Il Widget che ha attivato l'evento può essere recuperato con:

source: The Widget will be scrolled into view even if it is on a different page of a tabview.
it_it: Il Widget verrà visualizzato anche se si trova su una pagina diversa di una visualizzazione a schede.

source: The Widget will become the top-most (last/youngest) child of the new parent.
it_it: Il Widget diventerà il figlio più in alto (ultimo/più giovane) del nuovo genitore.

source: The Widgets can be in the combination of the following states:
it_it: I Widget possono trovarsi nella seguente combinazione di stati:

source: The Window Widget is built from a header (like a title bar) with title and buttons and a content area.
it_it: Il Widget Window è costituito da un'intestazione (simile a una barra del titolo) con titolo, pulsanti e un'area per i contenuti.

source: The Window is built from other Widgets so you can check their documentation for details:
it_it: La Window è costruita a partire da altri Widget, quindi di può consultare la relativa documentazione per i dettagli:

source: The X11 driver uses XLib to access the linux window manager.
it_it: Il driver X11 utilizza XLib per accedere al gestore delle finestre Linux.

source: The XML engine uses standard XML syntax; however, there are some special conventions for property names and values.
it_it: Il motore XML utilizza la sintassi XML standard; tuttavia, esistono alcune convenzioni speciali per i nomi e i valori delle proprietà.

source: The XML file can be written by hand, but it's highly recommended to use `LVGL Pro's Editor <editor>` to write the XML files.
it_it: Il file XML può essere scritto a mano, ma si consiglia vivamente di utilizzare `l'Editor di LVGL Pro <editor>` per scrivere i file XML.

source: The XML file of a Widget is wrapped in a ``<widget>`` XML root element.
it_it: Il file XML di un Widget è racchiuso in un elemento radice XML ``<widget>``.

source: The XML files can be used in two ways:
it_it: I file XML possono essere utilizzati in due modi:

source: The XML files need to be registered so that LVGL can parse their content.
it_it: I file XML devono essere registrati affinché LVGL possa analizzarne il contenuto.

source: The XML parser for the label Widget looks like this:
it_it: Il parser XML per il Widget Label si presenta così:

source: The XML test module is a powerful and flexible way to define functional UI tests.
it_it: Il modulo di test XML è un modo potente e flessibile per definire test funzionali dell'interfaccia utente.

source: The XML translation module allows defining and using translated strings directly within XML files.
it_it: Il modulo di traduzione XML consente di definire e utilizzare stringhe tradotte direttamente nei file XML.

source: The XMLs can be sent to the device via Bluetooth, WiFi, Serial port, loaded from an SD card, downloaded from a server, or anything else.
it_it: I file XML possono essere inviati al dispositivo tramite Bluetooth, Wi-Fi, porta seriale, caricati da una scheda SD, scaricati da un server o in qualsiasi altro modo.

source: The Yocto Project (YP) is an open source collaboration project that helps developers create custom Linux-based systems regardless of the hardware architecture.
it_it: The Yocto Project (YP) è un progetto collaborativo open source che aiuta gli sviluppatori a creare sistemi Linux personalizzati, indipendentemente dall'architettura hardware.

source: The Zephyr ecosystem is based on CMake, making the integration between projects relatively straightforward through the use of ``CMakeLists.txt`` files.
it_it: L'ecosistema Zephyr si basa su CMake, rendendo l'integrazione tra progetti relativamente semplice grazie all'utilizzo di file ``CMakeLists.txt``.

source: The `Eclipse <https://github.com/lvgl/lv_port_pc_eclipse>`__, `VSCode <https://github.com/lvgl/lv_port_pc_vscode>`__, and `Generic Linux <https://github.com/lvgl/lv_port_linux>`__ projects of LVGL use SDL to open a window and manage input devices.
it_it: I progetti `Eclipse <https://github.com/lvgl/lv_port_pc_eclipse>`__, `VSCode <https://github.com/lvgl/lv_port_pc_vscode>`__ e `Generic Linux <https://github.com/lvgl/lv_port_linux>`__ di LVGL utilizzano SDL per aprire una finestra e gestire i dispositivi di input.

source: The `ILI9341 <https://www.buydisplay.com/download/ic/ILI9341.pdf>`__ is a 262,144-color single-chip SOC driver for a-TFT liquid crystal display with resolution of 240RGBx320 dots, comprising a 720-channel source driver, a 320-channel gate driver, 172,800 bytes GRAM for graphic display data of 240RGBx320 dots, and power supply circuit.
it_it: `ILI9341 <https://www.buydisplay.com/download/ic/ILI9341.pdf>`__ è un driver SOC a chip singolo da 262.144 colori per display a cristalli liquidi a-TFT con risoluzione di 240RGBx320 punti, composto da un driver sorgente a 720 canali, un driver di gate a 320 canali, 172.800 byte di GRAM per dati di visualizzazione grafica di 240RGBx320 punti e un circuito di alimentazione.

source: The `LVGL library <https://github.com/lvgl/lvgl>`__ is directly available as Arduino libraries.
it_it: La libreria `LVGL library <https://github.com/lvgl/lvgl>`__ è disponibile direttamente come libreria Arduino.

source: The `LVGL library <https://github.com/lvgl/lvgl>`__ is directly available in the PlatformIO library registry and can be added to your project with just a few clicks.
it_it: La libreria `LVGL library <https://github.com/lvgl/lvgl>`__ è disponibile direttamente nel registro delle librerie di PlatformIO e può essere aggiunta al progetto con pochi clic.

source: The `LVGL micropython forum <https://forum.lvgl.io/c/micropython>`__ (Feel free to ask anything!)
it_it: Il forum `LVGL micropython <https://forum.lvgl.io/c/micropython>`__ (Si è liberi di chiedere qualsiasi cosa!)

source: The `NV3007 <https://www.buydisplay.com/download/ic/NV3007.pdf>`__ is a single-chip driver for 262,144-color, a-Si TFT liquid crystal display with maximum resolution of 168RGBx428 dots.
it_it: `NV3007 <https://www.buydisplay.com/download/ic/NV3007.pdf>`__ è un driver a chip singolo per display a cristalli liquidi TFT a-Si a 262.144 colori con una risoluzione massima di 168RGBx428 punti.

source: The `Offline converter <https://github.com/lvgl/lv_font_conv/>`__ generates kerning tables unless ``--no-kerning`` is specified.
it_it: Il `Convertitore offline <https://github.com/lvgl/lv_font_conv/>`__ genera tabelle di kerning a meno che non venga specificato ``--no-kerning``.

source: The `Online converter <https://lvgl.io/tools/fontconverter>`__ generates kerning tables.
it_it: Il `Convertitore online <https://lvgl.io/tools/fontconverter>`__ genera tabelle di kerning.

source: The `QR-Code-generator library <https://github.com/nayuki/QR-Code-generator>`__ by `nayuki <https://github.com/nayuki>`__ is a 3rd-party library that generates QR-Code bitmaps.
it_it: La `libreria QR-Code-generator <https://github.com/nayuki/QR-Code-generator>`__ di `nayuki <https://github.com/nayuki>`__ è una libreria di terze parti che genera bitmap di codici QR.

source: The `Rlottie animation player for LVGL <https://github.com/ValentiWorkLearning/lv_rlottie>`__ is a 3rd-party extension for LVGL that allows playing Lottie animations in LVGL.
it_it: Il `player di animazioni Rlottie per LVGL <https://github.com/ValentiWorkLearning/lv_rlottie>`__ è un'estensione di terze parti per LVGL che consente di riprodurre le animazioni Lottie in LVGL.

source: The `ST7735S <https://www.buydisplay.com/download/ic/ST7735S.pdf>`__ is a single-chip controller/driver for 262K-color, graphic type TFT-LCD.
it_it: `ST7735S <https://www.buydisplay.com/download/ic/ST7735S.pdf>`__ è un controller/driver a chip singolo per LCD TFT-LCD grafico a 262K colori.

source: The `ST7789 <https://www.buydisplay.com/download/ic/ST7789.pdf>`__ is a single-chip controller/driver for 262K-color, graphic type TFT-LCD.
it_it: L'`ST7789 <https://www.buydisplay.com/download/ic/ST7789.pdf>`__ è un controller/driver a chip singolo per TFT-LCD grafico a 262K colori.

source: The `ST7796S <https://www.buydisplay.com/download/ic/ST7796S.pdf>`__ is a single-chip controller/driver for 262K-color, graphic type TFT-LCD.
it_it: `ST7796S <https://www.buydisplay.com/download/ic/ST7796S.pdf>`__ è un controller/driver a chip singolo per display LCD TFT grafico a 262K colori.

source: The `Toradex documentation <https://developer.toradex.com>`_ is a helpful resource.
it_it: La `documentazione di Toradex <https://developer.toradex.com>`_ è una risorsa utile.

source: The `Yocto Project Compatible Layer Index <https://www.yoctoproject.org/development/ yocto-project-compatible-layers/>`_ and `OpenEmbedded Layer Index <https:// layers.openembedded.org/layerindex/branch/master/layers/>`_ both contain layers from which you can use or leverage.
it_it: Sia `Yocto Project Compatible Layer Index <https://www.yoctoproject.org/development/ yocto-project-compatible-layers/>`_ che `OpenEmbedded Layer Index <https:// layers.openembedded.org/layerindex/branch/master/layers/>`_ contengono layer che è possibile utilizzare o sfruttare.

source: The ``-d`` flag runs the container in detached mode.
it_it: Il flag ``-d`` esegue il container in modalità "detached".

source: The ``-p`` argument specifies the port mapping.
it_it: L'argomento ``-p`` specifica il mapping delle porte.

source: The ``-t`` argument gives a name to the resulting image.
it_it: L'argomento ``-t`` assegna un nome all'immagine risultante.

source: The ``.config`` file is now created and lists the configuration values.
it_it: Il file ``.config`` è stato creato e contiene l'elenco dei valori di configurazione.

source: The ``.so`` files are available in ``lvgl_yocto_guide/build/tmp/work/ cortexa53-poky-linux/lvgl/9.1.0/build/lib``.
it_it: I file ``.so`` sono disponibili in ``lvgl_yocto_guide/build/tmp/work/ cortexa53-poky-linux/lvgl/9.1.0/build/lib``.

source: The ``.so`` files you will find will depend on the LVGL configuration you used.
it_it: I file ``.so`` che si troveranno dipenderanno dalla configurazione LVGL utilizzata.

source: The ``<api>`` tag can be a child of ``<widget>`` and ``<component>`` tags.
it_it: Il tag ``<api>`` può essere figlio dei tag ``<widget>`` e ``<component>``.

source: The ``<subject_increment_event>`` element defines a ``step`` to be added to the subject's current value when the ``trigger`` occurs.
it_it: L'elemento ``<subject_increment_event>`` definisce uno ``step`` da aggiungere al valore corrente del soggetto quando si verifica il ``trigger``.

source: The ``<view>`` itself is also a widget or component, which will become the parent of the children.
it_it: Anche ``<view>`` è un widget o un componente, che diventerà il genitore dei figli.

source: The ``<view>`` tag can be used in:
it_it: Il tag ``<view>`` può essere utilizzato:

source: The ``Dockerfile`` acts like a recipe to build two images: ``build`` and ``deploy``.
it_it: Il ``Dockerfile`` funziona come una ricetta per creare due immagini: ``build`` e ``deploy``.

source: The ``LV_EVENT_VALUE_CHANGED`` event fires only when node properties are modified, not every frame
it_it: L'evento ``LV_EVENT_VALUE_CHANGED`` si attiva solo quando le proprietà del nodo vengono modificate, non a ogni frame.

source: The ``LV_LVGL_H_INCLUDE_SIMPLE`` define controls how LVGL headers are included.
it_it: La definizione ``LV_LVGL_H_INCLUDE_SIMPLE`` controlla come vengono inclusi gli header LVGL.

source: The ``Quick-Access Panel`` behaves like a typical navigation panel and appears on the left, while the ``Browser Panel`` appears on the right
it_it: Il ``Pannello Quick-Access`` si comporta come un tipico pannello di navigazione e appare a sinistra, mentre il ``Pannello Browser`` appare a destra.

source: The ``angle_x10`` argument is an ``int32_t`` containing the angle (in degrees) multiplied by 10.
it_it: L'argomento ``angle_x10`` è un ``int32_t`` contenente l'angolo (in gradi) moltiplicato per 10.

source: The ``anim_time`` style property sets the animation time if the values set with :cpp:enumerator:`LV_ANIM_ON`.
it_it: La proprietà di stile ``anim_time`` imposta il tempo di animazione se i valori sono impostati con :cpp:enumerator:`LV_ANIM_ON`.

source: The ``anim_time`` style property sets the cursor's blink time.
it_it: La proprietà di stile ``anim_time`` imposta il tempo di lampeggìo del cursore.

source: The ``brightness`` value should be in the range 0 (darkest) to 255 (lightest).
it_it: Il valore di ``brightness`` deve essere compreso tra 0 (più scuro) e 255 (più chiaro).

source: The ``clip_corner`` style property causes the corners of the parent Widget to clip the corners of child Widgets whose corners would otherwise overflow a rounded corner of the parent.
it_it: La proprietà di stile ``clip_corner`` fa sì che gli angoli del Widget padre ritaglino gli angoli dei Widget figlio, i cui angoli altrimenti supererebbero un angolo arrotondato del genitore.

source: The ``color_format`` can be changed with :cpp:expr:`lv_display_set_color_depth(display, LV_COLOR_FORMAT_...)`.
it_it: Il ``color_format`` può essere modificato con :cpp:expr:`lv_display_set_color_depth(display, LV_COLOR_FORMAT_...)`.

source: The ``deploy`` image will be deployed on the device.
it_it: L'immagine ``deploy`` verrà distribuita sul dispositivo.

source: The ``filter-name`` part of ``transform-filter-name.py`` shall be given in your ``frogfs.yaml`` ``filter`` list for certain types or all types of files.
it_it: La parte ``filter-name`` di ``transform-filter-name.py`` deve essere specificata nell'elenco ``filter`` di ``frogfs.yaml`` per determinati tipi di file o per tutti i tipi di file.

source: The ``flags`` argument can contain a single, or bit-wise OR-ed combination of any of the ``LV_OBJ_FLAG_...`` enumeration values.
it_it: L'argomento ``flags`` può contenere un singolo valore o una combinazione tramite OR bit a bit di uno qualsiasi dei valori dell'enumerazione ``LV_OBJ_FLAG_...``.

source: The ``flags`` argument controls the navigation behavior:
it_it: L'argomento ``flags`` controlla il comportamento della navigazione:

source: The ``font_family`` parameter can be filled with the names of multiple fonts (separated by ``,``) to achieve font concatenation (when the corresponding glyph is not found in a font file, it will automatically search from the next concatenated font).
it_it: Il parametro ``font_family`` può essere compilato con i nomi di più font (separati da ``,`` [virgola]) per ottenere la concatenazione dei font (quando il glifo corrispondente non viene trovato in un file font, la ricerca verrà eseguita automaticamente a partire dal font concatenato successivo).

source: The ``format-source`` local hook (see ``.pre-commit-config.yaml``) runs **astyle** on all the staged source and header files (that are not excluded, see ``exclude`` key of the hook configuration) before entering the commit message, if any file gets formatted by **astyle** you will need to add the change to the staging area and run ``git commit`` again.
it_it: L'hook locale ``format-source`` (vedere ``.pre-commit-config.yaml``) esegue **astyle** su tutti i file sorgente e header in staging (che non sono esclusi, vedere la chiave ``exclude`` della configurazione dell'hook) prima di inserire il messaggio di commit. Se un file viene formattato da **astyle** sarà necessario aggiungere la modifica all'area di staging ed eseguire nuovamente ``git commit``.

source: The ``format_string`` Argument
it_it: Argomento ``format_string``

source: The ``format_string`` argument is optional and if provided, must contain exactly 1 printf-like format specifier and be one of the following:
it_it: L'argomento ``format_string`` è facoltativo e, se fornito, deve contenere esattamente 1 specificatore di formato simile a printf ed essere uno dei seguenti:

source: The ``grad`` field of the fill descriptor (or :cpp:type:`lv_grad_dsc_t` in general) supports:
it_it: Il campo ``grad`` del descrittore di riempimento (o :cpp:type:`lv_grad_dsc_t` in generale) supporta i tipi:

source: The ``host`` folder contains files and binaries that are built for the host system rather than the target system.
it_it: La cartella ``host`` contiene file e binari compilati per il sistema host anziché per il sistema target.

source: The ``kconfiglib`` offers the python API and some CLI commands.
it_it: ``kconfiglib`` offre l'API Python e alcuni comandi CLI.

source: The ``kerning`` argument will be one of the ``LV_FONT_KERNING_...`` values, indicating whether to allow kerning, if supported, or disable.
it_it: L'argomento ``kerning`` sarà uno dei valori ``LV_FONT_KERNING_...``, che indica se consentire o meno il kerning, se supportato.

source: The ``lv_obj_init_draw_...`` functions automatically initialize the fields of the base descriptor.
it_it: Le funzioni ``lv_obj_init_draw_...`` inizializzano automaticamente i campi del descrittore di base.

source: The ``lv_observer`` module is an implementation of the `Observer Pattern`_.
it_it: Il modulo ``lv_observer`` è un'implementazione del `Pattern Observer`_.

source: The ``lvgl`` directory also contains an ``examples`` and a ``demos`` directory.
it_it: La directory ``lvgl`` contiene anche le directory ``examples`` e ``demos``.

source: The ``opa`` field adjusts overall opacity.
it_it: Il campo ``opa`` regola l'opacità complessiva.

source: The ``selector`` can also use the :cpp:enumerator:`LV_STATE_ANY` and :cpp:enumerator:`LV_PART_ANY` values to remove the style from any state or part.
it_it: Il ``selector`` può anche utilizzare i valori :cpp:enumerator:`LV_STATE_ANY` e :cpp:enumerator:`LV_PART_ANY` per rimuovere lo stile da qualsiasi stato o parte.

source: The ``states`` argument can contain a single, or bit-wise OR-ed combination of any of the ``LV_STATE_...`` enumeration values.
it_it: L'argomento ``states`` può contenere un singolo valore o una combinazione con OR bit a bit di uno qualsiasi dei valori dell'enumerazione ``LV_STATE_...``.

source: The ``style`` argument can be ``NULL`` to match only the ``selector`` and remove all matching styles.
it_it: L'argomento ``style`` può essere ``NULL`` per trovare solo ``selector`` e rimuovere tutti gli stili corrispondenti.

source: The ``target`` folder contains the files that are specifically intended for the target system.
it_it: La cartella ``target`` contiene i file specificamente destinati al sistema di destinazione.

source: The ``temp`` subfolder contains important logs that can help you diagnose build issues.
it_it: La sottocartella ``temp`` contiene log importanti che possono aiutare a diagnosticare i problemi di build.

source: The ``trailing-whitespace`` hook fixes trailing whitespaces on all of the files.
it_it: L'hook ``trailing-whitespace`` corregge gli spazi vuoti finali su tutti i file.

source: The ``type`` member can be:
it_it: Il membro ``type`` può essere:

source: The ``user_data`` is optional.
it_it: ``user_data`` è facoltativo.

source: The ``value`` field is also capable of carrying the different value types for styles.
it_it: Il campo ``value`` è anche in grado di contenere i diversi tipi di valore per gli stili.

source: The ``width`` and ``height`` of the Widget is set in the ``lv_rlottie_create_from_...()`` function, and the animation will be scaled accordingly.
it_it: ``width`` e ``height`` del Widget vengono impostate nella funzione ``lv_rlottie_create_from_...()`` e l'animazione verrà ridimensionata di conseguenza.

source: The ``work`` folder in Yocto is a key directory in the ``tmp`` folder that holds all the temporary build artifacts for each package during the build process.
it_it: La cartella ``work`` in Yocto è una directory chiave nella cartella ``tmp`` che contiene tutti gli artefatti di build temporanei per ogni pacchetto durante il processo di build.

source: The ``work`` folder is typically structured by machine architecture and package.
it_it: La cartella ``work`` è in genere strutturata in base all'architettura della macchina e al pacchetto.
